'''
2023-05-02
정성욱
range()함수 - 순차적 범위의 숫자 생성하는 함수
'''

for i in range(10): #반복조건(i - 반복횟수 변수, renge가 만든 숫자가 저장됨)
    print(i,end=' ')    #반복조건이 참인 동안 반복, i를 출력하고 공백으로 연결함

print()

for i in range(1,10): #반복조건(i - 반복횟수 변수, renge가 만든 숫자가 저장됨)
    print(i,end=' ')    #반복조건이 참인 동안 반복, i를 출력하고 공백으로 연결함

print()

for j in range(1,11,2): #반복조건(i - 반복횟수 변수, renge가 만든 숫자가 저장됨)
    print(j,end=' ')    #반복조건이 참인 동안 반복, i를 출력하고 공백으로 연결함, 순차적으로 출력

print()

for p in range(10,0,-1): #반복조건(i - 반복횟수 변수, renge가 만든 숫자가 저장됨)
    print(p,end=' ')    #반복조건이 참인 동안 반복, i를 출력하고 공백으로 연결함 , 역순으로 출력
    